=====================================
Integers
=====================================

-1
0xDEAD
0XDEAD
1j
-1j
0o123
0O123
0b001
0B001
1_1
0B1_1
0O1_1
0L

---

(module
  (expression_statement (unary_operator (integer)))
  (expression_statement (integer))
  (expression_statement (integer))
  (expression_statement (integer))
  (expression_statement (unary_operator (integer)))
  (expression_statement (integer))
  (expression_statement (integer))
  (expression_statement (integer))
  (expression_statement (integer))
  (expression_statement (integer))
  (expression_statement (integer))
  (expression_statement (integer))
  (expression_statement (integer)))

=====================================
Floats
=====================================

-.6_6
+.1_1
123.4123
123.123J
1_1.3_1
1_1.
1e+3_4j
.3e1_4
1_0.l
.1l

---

(module
  (expression_statement (unary_operator (float)))
  (expression_statement (unary_operator (float)))
  (expression_statement (float))
  (expression_statement (float))
  (expression_statement (float))
  (expression_statement (float))
  (expression_statement (float))
  (expression_statement (float))
  (expression_statement (float))
  (expression_statement (float)))


=====================================
Scientific Notation Floats
=====================================

1e322
1e-3
1e+3
1.8e10
1.e10
-1e10

---

(module
  (expression_statement (float))
  (expression_statement (float))
  (expression_statement (float))
  (expression_statement (float))
  (expression_statement (float))
  (expression_statement (unary_operator (float))))

=====================================
Strings
=====================================

"I'm ok"
'"ok"'
r'hi'
ur"bye"
b'sup'
`1`
"\\"
"/"
"multiline \
string"

---

(module
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string)))

=====================================
Other primitives
=====================================

True
False
None

---

(module
  (expression_statement (true))
  (expression_statement (false))
  (expression_statement (none)))

=====================================
Concatenated strings
=====================================

"one" "two" "three"

---

(module
  (expression_statement (concatenated_string
    (string)
    (string)
    (string))))

=====================================
Multi-line strings
=====================================

"""
A double quote hello,
without double or single quotes.
"""

"""
A double quote "hello",
with double quotes.
"""

"""
A double quote 'hello',
with single quotes.
"""

'''
A single quote hello,
without double or single quotes.
'''

'''
A single quote 'hello',
with single quotes.
'''

'''
A single quote "hello",
with double quotes.
'''

"""
A double quote hello\n\
with an escaped newline\n\
and another escaped newline\n\
"""

---

(module
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string))
  (expression_statement (string)))

=====================================
Lists
=====================================

[a, b, [c, d]]

---

(module
  (expression_statement (list
    (identifier)
    (identifier)
    (list
      (identifier)
      (identifier)))))

=====================================
List comprehensions
=====================================

[a + b for (a, b) in items]
[a for b in c for a in b]
[a for b in lambda: True, lambda: False if True]

---

(module
  (expression_statement (list_comprehension
    (binary_operator
      (identifier)
      (identifier))
    (variables
      (tuple (identifier) (identifier)))
    (identifier)))
  (expression_statement (list_comprehension
    (identifier)
    (variables (identifier))
    (identifier)
    (variables (identifier))
    (identifier)))
  (expression_statement (list_comprehension
    (identifier)
    (variables (identifier))
    (lambda (true))
    (lambda (conditional_expression (false) (true))))))

=====================================
Dictionaries
=====================================

{a: 1, b: 2}
{}

---

(module
  (expression_statement (dictionary
    (pair (identifier) (integer))
    (pair (identifier) (integer))))
  (expression_statement (dictionary)))

=====================================
Dictionary comprehensions
=====================================

{a: b for a, b in items}
{a: b for c in d for e in items}

---

(module
  (expression_statement (dictionary_comprehension
    (identifier)
    (identifier) (variables (identifier) (identifier)) (identifier)))
  (expression_statement (dictionary_comprehension
    (identifier)
    (identifier) (variables (identifier)) (identifier) (variables (identifier)) (identifier))))

=====================================
Sets
=====================================

{a, b, c,}

---

(module
  (expression_statement (set
    (identifier)
    (identifier)
    (identifier))))

=====================================
Set comprehensions
=====================================

{a[b][c] for a, b, c in items}
{r for s in qs for n in ms}

---

(module
  (expression_statement (set_comprehension
    (subscript (subscript (identifier) (identifier)) (identifier))
    (variables (identifier) (identifier) (identifier))
    (identifier)))
  (expression_statement (set_comprehension
    (identifier) (variables (identifier)) (identifier) (variables (identifier)) (identifier))))

=====================================
Tuples
=====================================

(a, b)
(a, b, c,)

---

(module
  (expression_statement (tuple (identifier) (identifier)))
  (expression_statement (tuple (identifier) (identifier) (identifier))))

=====================================
Generator expression
=====================================

(a[b][c] for a, b, c in items)
dict((a, b) for a, b in d)
(a for b in c for d in e,)

---

(module
  (expression_statement (generator_expression
    (subscript (subscript (identifier) (identifier)) (identifier))
    (variables (identifier) (identifier) (identifier))
    (identifier)))
  (expression_statement (call
    (identifier)
    (generator_expression
      (tuple (identifier) (identifier))
      (variables (identifier) (identifier))
      (identifier))))
  (expression_statement (generator_expression
    (identifier)
    (variables (identifier))
    (identifier)
    (variables (identifier))
    (identifier))))
